{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "\/model.2\/m.0\/cv1\/conv\/Conv",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "\/model.2\/m.0\/cv1\/conv\/Conv_output_0",
      "blob_weights" : 3,
      "K" : 16,
      "blob_biases" : 1,
      "name" : "\/model.2\/m.0\/cv1\/conv\/Conv",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "\/model.2\/Split_output_1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "\/model.2\/m.0\/cv1\/conv\/Conv_output_0",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "\/model.2\/m.0\/cv1\/act\/Sigmoid",
      "top" : "\/model.2\/m.0\/cv1\/act\/Sigmoid_output_0",
      "type" : "activation",
      "name" : "\/model.2\/m.0\/cv1\/act\/Sigmoid"
    },
    {
      "bottom" : "\/model.2\/m.0\/cv1\/conv\/Conv_output_0,\/model.2\/m.0\/cv1\/act\/Sigmoid_output_0",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "\/model.2\/m.0\/cv1\/act\/Mul",
      "top" : "\/model.2\/m.0\/cv1\/act\/Mul_output_0",
      "type" : "elementwise",
      "name" : "\/model.2\/m.0\/cv1\/act\/Mul",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "\/model.2\/m.0\/cv2\/conv\/Conv",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "\/model.2\/m.0\/cv2\/conv\/Conv_output_0",
      "blob_weights" : 7,
      "K" : 16,
      "blob_biases" : 5,
      "name" : "\/model.2\/m.0\/cv2\/conv\/Conv",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "\/model.2\/m.0\/cv1\/act\/Mul_output_0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "\/model.2\/m.0\/cv2\/conv\/Conv_output_0",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "\/model.2\/m.0\/cv2\/act\/Sigmoid",
      "top" : "\/model.2\/m.0\/cv2\/act\/Sigmoid_output_0",
      "type" : "activation",
      "name" : "\/model.2\/m.0\/cv2\/act\/Sigmoid"
    },
    {
      "bottom" : "\/model.2\/m.0\/cv2\/conv\/Conv_output_0,\/model.2\/m.0\/cv2\/act\/Sigmoid_output_0",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "\/model.2\/m.0\/cv2\/act\/Mul",
      "top" : "\/model.2\/m.0\/cv2\/act\/Mul_output_0",
      "type" : "elementwise",
      "name" : "\/model.2\/m.0\/cv2\/act\/Mul",
      "beta" : 0
    },
    {
      "bottom" : "\/model.2\/Split_output_1,\/model.2\/m.0\/cv2\/act\/Mul_output_0",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "\/model.2\/m.0\/Add",
      "top" : "\/model.2\/m.0\/Add_output_0",
      "type" : "elementwise",
      "name" : "\/model.2\/m.0\/Add",
      "beta" : 0
    },
    {
      "weights" : {

      },
      "debug_info" : "\/model.2\/Concat",
      "top" : "\/model.2\/Concat_output_0",
      "type" : "concat",
      "name" : "\/model.2\/Concat",
      "bottom" : "\/model.2\/Split_output_0,\/model.2\/Split_output_1,\/model.2\/m.0\/Add_output_0"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "\/model.2\/cv2\/conv\/Conv",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "\/model.2\/cv2\/conv\/Conv_output_0",
      "blob_weights" : 11,
      "K" : 48,
      "blob_biases" : 9,
      "name" : "\/model.2\/cv2\/conv\/Conv",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "\/model.2\/Concat_output_0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "\/model.2\/cv2\/conv\/Conv_output_0",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "\/model.2\/cv2\/act\/Sigmoid",
      "top" : "\/model.2\/cv2\/act\/Sigmoid_output_0",
      "type" : "activation",
      "name" : "\/model.2\/cv2\/act\/Sigmoid"
    },
    {
      "bottom" : "\/model.2\/cv2\/conv\/Conv_output_0,\/model.2\/cv2\/act\/Sigmoid_output_0",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "\/model.2\/cv2\/act\/Mul",
      "top" : "\/model.2\/cv2\/act\/Mul_output_0",
      "type" : "elementwise",
      "name" : "\/model.2\/cv2\/act\/Mul",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "\/model.3\/conv\/Conv",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "\/model.3\/conv\/Conv_output_0",
      "blob_weights" : 15,
      "K" : 32,
      "blob_biases" : 13,
      "stride_x" : 2,
      "name" : "\/model.3\/conv\/Conv",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "\/model.2\/cv2\/act\/Mul_output_0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "\/model.3\/conv\/Conv_output_0",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "\/model.3\/act\/Sigmoid",
      "top" : "\/model.3\/act\/Sigmoid_output_0",
      "type" : "activation",
      "name" : "\/model.3\/act\/Sigmoid"
    },
    {
      "bottom" : "\/model.3\/conv\/Conv_output_0,\/model.3\/act\/Sigmoid_output_0",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "\/model.3\/act\/Mul",
      "top" : "\/model.3\/act\/Mul_output_0",
      "type" : "elementwise",
      "name" : "\/model.3\/act\/Mul",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "\/model.4\/cv1\/conv\/Conv",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "\/model.4\/cv1\/conv\/Conv_output_0",
      "blob_weights" : 19,
      "K" : 64,
      "blob_biases" : 17,
      "name" : "\/model.4\/cv1\/conv\/Conv",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "\/model.3\/act\/Mul_output_0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "\/model.4\/cv1\/conv\/Conv_output_0",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "\/model.4\/cv1\/act\/Sigmoid",
      "top" : "\/model.4\/cv1\/act\/Sigmoid_output_0",
      "type" : "activation",
      "name" : "\/model.4\/cv1\/act\/Sigmoid"
    },
    {
      "bottom" : "\/model.4\/cv1\/conv\/Conv_output_0,\/model.4\/cv1\/act\/Sigmoid_output_0",
      "alpha" : 1,
      "operation" : 1,
      "beta" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "\/model.4\/cv1\/act\/Mul",
      "top" : "\/model.4\/cv1\/act\/Mul_output_0",
      "type" : "elementwise",
      "name" : "\/model.4\/cv1\/act\/Mul",
      "attributes" : {
        "is_output" : 1
      }
    }
  ]
}