{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "name" : "pre_process_9",
      "fused_relu" : 0,
      "beta" : 0,
      "operation" : 1,
      "type" : "elementwise",
      "alpha" : 1,
      "attributes" : {
        "is_output" : 1
      },
      "bottom" : "_ppp2_f_hw,_ppp2_ratio_resize",
      "debug_info" : "pre_process_9",
      "nd_mode" : true,
      "weights" : {

      },
      "top" : "_ppp2_f_hw2_exact"
    }
  ]
}